Repository: digitalali-moj/opg-use-an-lpa
Catalog: service-front/app/languages/*.po
Languages: cy

source: View a lasting power of attorney
cy: A oes gennych gyfrif pŵer atwrnai parhaol

source: This is a new service – your <a class="govuk-link" href="{link}" target="_blank">feedback</a> will help us to improve it.
cy: Mae hwn yn wasanaeth newydd-bydd eich <a class=\”govuk-link\” href=\”{link}\” target=\”_blank\”>adborth</a> yn ein helpu i’w wella.

source: Enter LPA access code
cy: Rhowch god mynediad yr ACLL

source: Back
cy: Nôl

source: Enter the LPA access code
cy: Rhowch god mynediad yr ACLL

source: Donor's last name
cy: Enw olaf y rhoddwr

source: LPA access code
cy: Rhowch god mynediad yr ACLL

source: Access codes are 13 characters long and start with a V<br/>For example, V-AB12-CD34-EF56
cy: Mae codau mynediad yn 13 nod hir ac yn dechrau gyda V<br/>Er enghraifft, V-AB12-CD34-EF56

source: What is an <abbr title="lasting power of attorney">LPA</abbr> access code?
cy: Beth yw cod mynediad yr <abbr title="lasting power of attorney">ACLl</abbr> ?

source: An <abbr title="lasting power of attorney">LPA</abbr> access code is a unique code given to you by the donor or an attorney named on a lasting power of attorney.
cy: Mae cod mynediad <abbr title=\”pŵer atwrnai parhaol\”>ACLl</abbr> yn god unigryw a roddir i chi gan y rhoddwr neu atwrnai a enwir ar atwrneiaeth arhosol.

source: By continuing you agree to our <a href="{link}" class="govuk-link">terms of use</a>.
cy: Trwy barhau rydych yn cytuno i’n <a href=\”{link}\” class=\”govuk-link\”>telerau defnyddio</a>.

source: Continue
cy: Parhau

source: Do you have a Use a lasting power of attorney account?
cy: A oes gennych gyfrif pŵer atwrnai parhaol?

source: If you're named on more than one LPA, you can add all those LPAs to your account.
cy: Os ydych wedi’ch enwi ar fwy nag un ACLL, gallwch ychwanegu’r holl ACLlau hynny at eich cyfrif.

source: Enter your LPA access code
cy: Rhowch god mynediad eich ACLL

source: Enter the donor's last name
cy: Rhowch enw olaf y rhoddwr

source: There is a problem
cy: Mae problem

source: If you made an LPA online, you will still need to create an account to use this service
cy: Os ydych chi wedi gwneud ACLL ar-lein, bydd dal angen i chi greu cyfrif i ddefnyddio’r gwasanaeth hwn

source: Yes, I already have an account
cy: Oes, mae gen I gyfrif eisoes

source: No, this is the first time I’ve used the service
cy: Na, dyma’r tro cyntaf I mi ddefnyddio’r gwasanaeth

source: Email address
cy: Cyfeiriad e-bost

source: Password
cy: Cyfrinair

source: Day
cy: Diwrnod

source: Month
cy: Mis

source: Year
cy: Blwyddyn

source: What is your date of birth?
cy: Beth yw eich dyddiad geni?

source: For example, 31 03 1980
cy: Er enghraifft, 31 03 1980

source: I agree to the <a href="/terms-of-use" class="govuk-link">terms of use</a>
cy: Cytunaf i’r <a href=\”/cy/terms-of-use\” class=\”govuk-link\”>telerau defnyddio</a>

source: Error:
cy: Gwall:

source: Terms of use
cy: Telerau defnyddio

source: The Use a lasting power of attorney (LPA) service lets donors and attorneys share a summary of an
cy: Mae’r gwasanaeth Defnyddio pŵer atwrnai parhaol (LPA) yn gadael i roddwyr ac atwrneiod rannu crynodeb o

source: with professionals or organisations by creating a unique ‘access code’.
cy: gyda gweithwyr proffesiynol neu sefydliadau trwy greu ‘cod mynediad’ unigryw.

source: View a lasting power of attorney is the part of this service that lets you see a summary of an
cy: Gweld pŵer atwrnai parhaol yw’r rhan o’r gwasanaeth hwn sy’n gadael i chi weld crynodeb o

source: using the access code given to you by the donor or an attorney.
cy: gan ddefnyddio’r cod mynediad a roddwyd i chi gan y rhoddwr neu atwrnai.

source: This part of the service is for professionals or organisations providing a service to the donor. For example, financial institutions, medical professionals, and care organisations.
cy: Mae’r rhan hon o’r gwasanaeth ar gyfer gweithwyr proffesiynol neu sefydliadau sy’n darparu gwasanaeth i’r rhoddwr. Er enghraifft, sefydliadau ariannol, gweithwyr meddygol proffesiynol, a sefydliadau gofal.

source: You can use this service instead of asking to see the original paper
cy: Gallwch ddefnyddio’r gwasanaeth hwn yn lle gofyn am gael gweld y papur gwreiddiol

source: lasting power of attorney
cy: pŵer atwrnai parhaol

source: LPA
cy: ACLl

source: By using this service you:
cy: Trwy ddefnyddio’r gwasanaeth hwn rydych chi:

source: agree to these terms of use and the
cy: cytuno i’r telerau defnyddio hyn a’r

source: GOV.UK terms and conditions
cy: Telerau ac amodau GOV.UK

source: It can be a criminal offence to use someone’s personal information without their permission.
cy: Gall fod yn drosedd defnyddio gwybodaeth bersonol rhywun heb eu caniatâd.

source: Information security
cy: Diogelwch gwybodaeth

source: You and your organisation are responsible for your use of View a lasting power of attorney.
cy: Rydych chi a’ch sefydliad yn gyfrifol am eich defnydd o Gweld atwrneiaeth barhaol.

source: If you download a copy of an <abbr title="lasting power of attorney">LPA</abbr> summary, or record details of the summary, <b>your organisation becomes the ‘data controller’ of that information.</b> This means your organisation will be responsible for keeping the information safe and secure, in line with Data Protection Act 2018.
cy: Os byddwch yn lawrlwytho copi o <abbr title = “pŵer atwrnai parhaol”> crynodeb LPA </abbr>, neu’n cofnodi manylion y crynodeb, <b> bydd eich sefydliad yn dod yn ‘reolwr data’ y wybodaeth honno. > Mae hyn yn golygu y bydd eich sefydliad yn gyfrifol am gadw’r wybodaeth yn ddiogel, yn unol â Deddf Diogelu Data 2018.

source: Accessing the service securely
cy: Cyrchu’r gwasanaeth yn ddiogel

source: You’re responsible for accessing the service securely. You should not access it using a computer or network that may leave personal information accessible to others or you think may be insecure. For example, you should not:
cy: Rydych chi’n gyfrifol am gyrchu’r gwasanaeth yn ddiogel. Ni ddylech ei gyrchu gan ddefnyddio cyfrifiadur neu rwydwaith a allai adael gwybodaeth bersonol yn hygyrch i eraill neu rydych chi’n meddwl a allai fod yn ansicr. Er enghraifft, ni ddylech:

source: leave a computer unprotected while you’re using the service
cy: gadewch gyfrifiadur heb ddiogelwch tra’ch bod chi’n defnyddio’r gwasanaeth

source: access the service using a shared or public computer
cy: cyrchu’r gwasanaeth gan ddefnyddio cyfrifiadur cyhoeddus a rennir

source: We recommend that you close the tab on your web browser when you’ve finished using the service. We’ll automatically return you to the service start page if you have not used the service for 60 minutes.
cy: Rydym yn argymell eich bod yn cau’r tab ar eich porwr gwe pan fyddwch wedi gorffen defnyddio’r gwasanaeth. Byddwn yn eich dychwelyd yn awtomatig i dudalen cychwyn y gwasanaeth os nad ydych wedi defnyddio’r gwasanaeth am 60 munud.

source: Keeping information up to date
cy: Cadw gwybodaeth yn gyfredol

source: <abbr title="lasting powers of attorney">LPAs</abbr> can change. For example, attorneys may change, people’s names or addresses may change, or the donor may cancel their LPA.
cy: Gall <abbr title = “pwerau atwrnai parhaol”> ACLl </abbr> newid. Er enghraifft, gall atwrneiod newid, gall enwau neu gyfeiriadau pobl newid, neu gall y rhoddwr ganslo ei ACLl.

source: We use OPG’s records about registered <abbr title="lasting powers of attorney">LPAs</abbr> to keep this service up to date. However:
cy: Gall <abbr title = “pwerau atwrnai parhaol”> ACLl </abbr> newid. Er enghraifft, gall atwrneiod newid, gall enwau neu gyfeiriadau pobl newid, neu gall y rhoddwr ganslo ei ACLl:

source: we rely on donors and attorneys to tell us about any changes
cy: rydym yn dibynnu ar roddwyr ac atwrneiod i ddweud wrthym am unrhyw newidiadau

source: once we’re told about a change, it may take several days before we update the <abbr title="lasting power of attorney">LPA</abbr> summary on the service
cy: unwaith y byddwn wedi cael gwybod am newid, gall gymryd sawl diwrnod cyn i ni ddiweddaru’r crynodeb <abbr title = “pŵer atwrnai parhaol”> LPA </abbr> ar y gwasanaeth

source: The online summary
cy: Y crynodeb ar-lein

source: Any screenshots, downloads or printouts of the <abbr title="lasting power of attorney">LPA</abbr> summary are not proof of an <abbr title="lasting power of attorney">LPA</abbr> and may not show the latest status of an <abbr title="lasting power of attorney">LPA</abbr>.
cy: Nid yw unrhyw sgrinluniau, lawrlwythiadau neu allbrintiau o’r crynodeb <abbr title = “pŵer atwrnai parhaol”> LPA </abbr> yn brawf o <abbr title = “pŵer atwrnai parhaol”> LPA </abbr> ac efallai na fyddant yn dangos statws diweddaraf teitl <abbr = “pŵer atwrnai parhaol”> LPA </abbr>.

source: Tracking use of the service
cy: Olrhain defnydd o’r gwasanaeth

source: If you suspect fraud or abuse
cy: Os ydych chi’n amau ​​twyll neu gamdriniaeth

source: <a class="govuk-link" href="https://www.gov.uk/report-concern-about-attorney-deputy">Contact the Office of the Public Guardian</a> if you have concerns about the actions of an attorney. For example, if you’re concerned they’re misusing a donor’s money or are making decisions that are not in the donor’s best interests.
cy: <a class=“govuk-link” href=“https://www.gov.uk/report-concern-about-attorney-deputy”> Cysylltwch â Swyddfa’r Gwarcheidwad Cyhoeddus </a> os oes gennych bryderon am y gweithredoedd atwrnai. Er enghraifft, os ydych chi’n pryderu eu bod yn camddefnyddio arian rhoddwr neu’n gwneud penderfyniadau nad yw er budd gorau’r rhoddwr.

source: If you suspect abuse, a criminal offence, or think someone is in immediate danger, <a class="govuk-link" href="https://www.gov.uk/contact-police">contact the police</a> first.
cy: Os ydych chi’n amau ​​camdriniaeth, trosedd, neu’n credu bod rhywun mewn perygl uniongyrchol, <a class=“govuk-link” href=“https://www.gov.uk/contact-police”> cysylltwch â’r heddlu </ a > yn gyntaf.

source: Governing law
cy: Cyfraith lywodraethol

source: These terms of use are governed by the laws of England and Wales, including:
cy: Mae’r telerau defnyddio hyn yn cael eu llywodraethu gan gyfreithiau Cymru a Lloegr, gan gynnwys:

source: Computer Misuse Act 1990
cy: Deddf Camddefnyddio Cyfrifiaduron 1990

source: General Data Protection Regulation 2018
cy: Rheoliad Diogelu Data Cyffredinol 2018

source: Data Protection Bill 2018
cy: Bil Diogelu Data 2018

source: Mental Capacity Act 2005
cy: Deddf Capasiti Meddwl 2005

source: Any dispute you have about these terms of use, or your use of OPG services (whether it be contractual or non-contractual), will be subject to the exclusive jurisdiction of the courts of England and Wales.
cy: Bydd unrhyw anghydfod sydd gennych ynglŷn â’r telerau defnyddio hyn, neu’ch defnydd o wasanaethau OPG (p’un a yw’n gontractiol neu’n anghontractiol), yn ddarostyngedig i awdurdodaeth unigryw llysoedd Cymru a Lloegr.

source: About these terms of use
cy: Ynglŷn â’r telerau defnyddio hyn

source: These terms of use affect your rights and responsibilities under the law. They govern your use of the View a lasting power of attorney service. They do not apply to any other department or online service. Please check these terms of use regularly. We may update them without notice. This might happen if there’s a change in the law or to the way the service works. You’ll agree to any changes if you continue to use the service after the terms of use have been updated
cy: Mae’r telerau defnyddio hyn yn effeithio ar eich hawliau a’ch cyfrifoldebau o dan y gyfraith. Maen nhw’n llywodraethu’ch defnydd o’r gwasanaeth pŵer atwrneiaeth barhaol. Nid ydynt yn berthnasol i unrhyw adran arall neu wasanaeth ar-lein. Gwiriwch y telerau defnyddio hyn yn rheolaidd. Efallai y byddwn yn eu diweddaru heb rybudd. Gallai hyn ddigwydd os bydd newid yn y gyfraith neu i’r ffordd y mae’r gwasanaeth yn gweithio. Byddwch yn cytuno i unrhyw newidiadau os byddwch yn parhau i ddefnyddio’r gwasanaeth ar ôl i’r telerau defnyddio gael eu diweddaru
